Tekla Open API Reference for Tekla Structures 2025
Picker.PickObjects Method
Overload List
Name | Description
PickObjects(Picker.PickObjectsEnum)
 Queries the user to pick model objects from the model.
PickObjects(Picker.PickObjectsEnum, String)
 Queries the user to pick model objects from the model with the given prompt.
Top
See Also
Reference
Picker Class
Tekla.Structures.Model.UI Namespace